
/*{USERNAME} is on your blocked list*/
"%@ is on your Blocked List" = "%@ este pe Lista ta de Blocare";

/*{link} is not a link.. in the link translate example to respective language*/
"%@\nis not a link, please copy a valid link\ni.e. http://www.example.com" = "%@ \nnu este un link, te rugăm să copiezi un link valid\nex. http://www.exemplu.com";

/*No comment provided by engineer.*/
"Are you sure you want to logout?" = "Ești sigur că vrei să te deconectezi?";

/*No comment provided by engineer.*/
"Are you sure?" = "Ești sigur?";

/*No comment provided by engineer.*/
"BACK" = "ÎNAPOI";

/*as in block another user*/
"BLOCK" = "BLOCARE";

/*No comment provided by engineer.*/
"Block Failed" = "Blocare Eșuată";

/*No comment provided by engineer.*/
"BLOCKED" = "BLOCAT";

/*Blocked {USERNAME}*/
"Blocked %@" = "%@ Blocat";

/*No comment provided by engineer.*/
"Can't send SMS" = "SMS-ul nu se poate trimite";

/*No comment provided by engineer.*/
"CANCEL" = "ANULARE";

/*No comment provided by engineer.*/
"Cancel" = "Anulare";

/*No comment provided by engineer.*/
"CANCELED" = "ANULAT";

/*No comment provided by engineer.*/
"Change" = "Schimbare";

/*No comment provided by engineer.*/
"Changed" = "Schimbat";

/*No comment provided by engineer.*/
"Check internet and try again." = "Verifică internetul și încearcă din nou.";

/*No comment provided by engineer.*/
"Check out the YoIndex to subscribe to awesome services!" = "Încearcă YoIndex pentru a te abona la servicii uimitoare!";

/*%@ = serviceName*/
"Check out this service I found on Yo! %@" = "Încearcă serviciul acesta pe care l-am găsit pe Yo! %@";

/*No comment provided by engineer.*/
"CHOOSE ANOTHER" = "ALEGE ALTA";

/*No comment provided by engineer.*/
"CHOOSE PASSCODE" = "ALEGE CODUL DE ACCES";

/*No comment provided by engineer.*/
"CHOOSE USERNAME" = "ALEGE NUME DE UTILIZATOR";

/*de-select all*/
"Clear All" = "Șterge Tot";

/*No comment provided by engineer.*/
"Close" = "Închide";

/*No comment provided by engineer.*/
"Connection error, let's try updating password again later" = "Eroare de conexiune, să încercăm actualizarea parolei mai târziu";

/*No comment provided by engineer.*/
"CONTACTS" = "CONTACTE";

/*No comment provided by engineer.*/
"COPY A LINK OR IMAGE\nTAP & HOLD TO YO IT" = "COPIAZĂ UN LINK SAU O IMAGINE\nAPASĂ & ȚINE PENTRU A DISTRIBUI";

/*No comment provided by engineer.*/
"Copy a link. Tap and hold to Yo it." = "Copiază un link. Apasă și ține pentru a-l distribui.";

/*No comment provided by engineer.*/
"Copy Link" = "Copiază Link";

/*No comment provided by engineer.*/
"Could not load page" = "Pagina nu s-a putut încărca";

/*No comment provided by engineer.*/
"Delete" = "Ștergere";

/*No comment provided by engineer.*/
"Didn't get code" = "Codul nu a fost primit";

/*No comment provided by engineer.*/
"Do you like the Yo app?" = "Îți place aplicația Yo?";

/*No comment provided by engineer.*/
"Do you want to unblock this user so they can Yo you back?" = "Dorești să deblochezi acest utilizator, ca acesta să-ți poată trimite Yo înapoi?";

/*No comment provided by engineer.*/
"DONE" = "EFECTUAT";

/*No comment provided by engineer.*/
"Done" = "Efectuat";

/*No comment provided by engineer.*/
"Double tap to Yo your location. Where Yo @?" = "Dublă apăsare pentru a-ți distribui locația cu Yo. Unde Yo @?";

/*No comment provided by engineer.*/
"DOUBLE TAP\nTO YO YOUR LOCATION" = "DUBLĂ APĂSARE\nPENTRU A-ȚI DISTRIBUI LOCAȚIA CU YO";

/*No comment provided by engineer.*/
"EDIT ACCOUNT" = "EDITARE CONT";

/*No comment provided by engineer.*/
"EDIT PROFILE" = "EDITARE PROFIL";

/*No comment provided by engineer.*/
"EMAIL SENT" = "EMAIL TRIMIS";

/*No comment provided by engineer.*/
"Email Us" = "Trimite-ne un Email";

/*No comment provided by engineer.*/
"Enable Camera\nSettings -> Privacy -> Camera" = "Activează Camera\nSetări -> Confidențialitate -> Cameră";

/*No comment provided by engineer.*/
"Enable Location" = "Activează Locația";

/*Give Yo your email Subject Text*/
"Enable Passcode Recovery" = "Activează Recuperarea Codului de Acces";

/*No comment provided by engineer.*/
"Enable Push" = "Activează Notificările Push";

/*No comment provided by engineer.*/
"ENTER FULL NAME" = "INTRODU NUME ÎNTREG";

/*No comment provided by engineer.*/
"Enter New Phone Number" = "Introdu Număr de Telefon Nou";

/*No comment provided by engineer.*/
"Enter New Username" = "Introdu Nume de Utilizator Nou";

/*No comment provided by engineer.*/
"ENTER PASSCODE" = "INTRODU CODUL DE ACCES";

/*No comment provided by engineer.*/
"Enter the code in the SMS" = "Introdu Codul din SMS";

/*No comment provided by engineer.*/
"ENTER USERNAME" = "INTRODU NUME DE UTILIZATOR";

/*# -> number as in phone number*/
"Enter Your Phone #" = "INTRODU NUMĂRUL TĂU DE TELEFON";

/*No comment provided by engineer.*/
"Error" = "Eroare";

/*As in existing photos. could also read photos*/
"EXISTING" = "Fotografii";

/*No comment provided by engineer.*/
"EXPLORE\nTHE POSSIBILITIES" = "EXPLOREAZĂ POSIBILITĂȚILE";

/*No comment provided by engineer.*/
"Failed" = "Eșuat";

/*No comment provided by engineer.*/
"FAILED" = "EȘUAT";

/*No comment provided by engineer.*/
"Failed to find friends on Facebook." = "Găsirea prietenilor de pe Facebook eșuată.";

/*No comment provided by engineer.*/
"Failed to find friends through contacts" = "Găsirea prietenilor din contacte eșuată.";

/*No comment provided by engineer.*/
"Failed To Get Location" = "Găsirea Locației Eșuată.";

/*No comment provided by engineer.*/
"Failed to login with Facebook. Please Try again." = "Conectarea prin Facebook eșuată. Încearcă din nou.";

/*No comment provided by engineer.*/
"Failed to unblock %@. Try again later" = "Deblocarea lui %@ eșuată. Încearcă din nou.";

/*No comment provided by engineer.*/
"Failed Yo" = "Yo Eșuat";

/*No comment provided by engineer.*/
"FAILED!" = "EȘUAT!";

/*Failed to send Yo*/
"FAILED! DO YOU HAVE INTERNET?" = "Eroare! Te rugăm să-ți verifici conexiunea.";

/*Facebook. does not need translateing*/
"FB" = "FB";

/*No comment provided by engineer.*/
"FEEDBACK" = "FEEDBACK";

/*No comment provided by engineer.*/
"FIND FRIENDS" = "GĂSEȘTE PRIETENI";

/*As in a From & To : a parcel/letter*/
"From" = "De la";

/*No comment provided by engineer.*/
"FULL NAME" = "NUME ÎNTREG";

/*Go as in proceed as in Send*/
"Go" = "Continuă";

/*just back works too*/
"GO BACK" = "ÎNAPOI";

/*As in Understood, or OK*/
"Got it!" = "În ordine!";

/*No comment provided by engineer.*/
"Hey There!" = "Ciao La Tine!";

/*No comment provided by engineer.*/
"HOW A YO IS RECEIVED" = "CUM SE PRIMEȘTE UN YO";

/*No comment provided by engineer.*/
"HOW TO" = "SFATURI";

/*No comment provided by engineer.*/
"HOW TO OPEN YO LINK" = "CUM SE DESCHIDE UN LINK YO";

/*No comment provided by engineer.*/
"HOW TO OPEN\nA YO LOCATION" = "CUM SE DESCHIDE O LOCAȚIE YO";

/*No comment provided by engineer.*/
"HOW TO SEND A YO" = "CUM SE TRIMITE UN YO";

/*I wanna Yo you!nAdd my Yo username by tapping here: {link}n(if you don't have Yo app get it here {other link})*/
"I wanna Yo you!\nAdd my Yo username by tapping here: %@\n(if you don't have Yo app get it here %@)" = "Vreau să-ți trimit un Yo!\nAdaugă numele meu de utilizator Yo, apăsând aici: %@\n(dacă nu ai aplicația Yo, ia-o de aici %@)";

/*No comment provided by engineer.*/
"I wanna Yo you!\nAdd my Yo username by tapping here: http://justyo.co/%@" = "Vreau să-ți trimit un Yo!\nAdaugă numele meu de utilizator Yo, apăsând aici: http://justyo.co/%@";

/*No comment provided by engineer.*/
"INCORRECT" = "INCORECT";

/*No comment provided by engineer.*/
"INDEX" = "INDEX";

/*No comment provided by engineer.*/
"INVITE" = "INVITĂ";

/*Invite button for invite friends popup*/
"Invite" = "Invită";

/*Title for invite friends popup*/
"Invite Friends!" = "Invită Prieteni!";

/*No comment provided by engineer.*/
"Just hit Send" = "Doar apasă pe Trimitere";

/*No comment provided by engineer.*/
"Just subscribed to get Yo'd from %@! Yo them at" = "Numai ce te-ai abonat să primești Yo-uri de la %@! Trimite-le Yo-uri";

/*No comment provided by engineer.*/
"Link Not Found" = "Linkul Nu a Fost Găsit";

/*No comment provided by engineer.*/
"LOGIN" = "CONECTARE";

/*No comment provided by engineer.*/
"Login Failed" = "Conectare Eșuată";

/*No comment provided by engineer.*/
"LOGOUT" = "DECONECTARE";

/*No comment provided by engineer.*/
"MAIL" = "MAIL";

/*No comment provided by engineer.*/
"MAPS" = "HĂRȚI";

/*No comment provided by engineer.*/
"Me" = "Eu";

/*No comment provided by engineer.*/
"MUTED" = "BLOCAT";

/*No*/
"Nah" = "Ba";

/*No comment provided by engineer.*/
"NEW PASSCODE" = "COD DE ACCES NOU";

/*No comment provided by engineer.*/
"NO" = "NU";

/*No comment provided by engineer.*/
"No" = "Nu";

/*:) -> Smile*/
"No Blocked Users! :)" = "Niciun Utilizator Blocat! :)";

/*No comment provided by engineer.*/
"No Camera Found" = "Camera Nu a Fost Găsită";

/*No comment provided by engineer.*/
"No contacts were found." = "Niciun contact nu a fost găsit.";

/*No comment provided by engineer.*/
"No Contacts!" = "Niciun Contact!";

/*No comment provided by engineer.*/
"NO EMAIL ACCOUNTS" = "NICIUN CONT EMAIL";

/*No comment provided by engineer.*/
"No Internet!" = "Nu există conexiune!";

/*As in photo library*/
"No Library Found" = "Nicio Galerie Nu a Fost Găsită";

/*No comment provided by engineer.*/
"No Such User" = "Niciun Astfel de Utilizator";

/*Cancel button for invite friends popup*/
"Not now" = "Nu acum";

/*No comment provided by engineer.*/
"OK" = "OK";

/*No comment provided by engineer.*/
"Open in Chrome" = "Deschide în Chrome";

/*No comment provided by engineer.*/
"Open in Safari" = "Deschide în Safari";

/*PASS as in passcode*/
"PASS" = "PAROLĂ";

/*No comment provided by engineer.*/
"PASSCODE" = "COD DE ACCES";

/*No comment provided by engineer.*/
"Passcode changed" = "Cod de acces schimbat";

/*No comment provided by engineer.*/
"Passcodes Do Not Match" = "Codurile de Acces Nu se Potrivesc";

/*As in Mobile, telephone*/
"PHONE" = "TELEFON";

/*No comment provided by engineer.*/
"Please add an email account in Settings -> Mail" = "Te rugăm să adaugi un cont de email în Setări -> Mail";

/*No comment provided by engineer.*/
"Please connect to Twitter in Settings -> Twitter" = "Te rugăm să te conectezi la Twitter în Setări -> Twitter";

/*please enable access to contacts*/
"Please enable contacts access" = "Te rugăm să activezi accesul contactelor";

/*No comment provided by engineer.*/
"Please enter a valid phone number" = "Te rugăm să introduci un număr de telefon valid";

/*No comment provided by engineer.*/
"Please retry. \n\n If the problem persists contact us and mention this error code: %@" = "Încearcă din nou.\nDacă problema persistă, contactează-ne și menționează acest cod de eroare: %@";

/*No comment provided by engineer.*/
"Please signup or login" = "Te rugăm să te înscrii sau să te conectezi";

/*No comment provided by engineer.*/
"Please try again" = "Te rugăm să încerci din nou";

/*No comment provided by engineer.*/
"Please try again later" = "Încearcă din nou mai târziu";

/*As to rate, rating, review*/
"RATE" = "EVALUEAZĂ";

/*PASS as in passcode*/
"RECOVER PASS" = "RECUPERARE COD DE ACCES";

/*No comment provided by engineer.*/
"Resend" = "Retrimite";

/*No comment provided by engineer.*/
"SAVE" = "SALVARE";

/*No comment provided by engineer.*/
"Saved!" = "Salvat!";

/*No comment provided by engineer.*/
"SELECT A USERNAME" = "SELECTEAZĂ UN NUME DE UTILIZATOR";

/*No comment provided by engineer.*/
"Select All" = "Selectează Tot";

/*No comment provided by engineer.*/
"SELECT LONGER PASSCODE" = "SELECTEAZĂ COD DE ACCES MAI LUNG";

/*No comment provided by engineer.*/
"SELECT USERNAMES TO SHARE" = "SELECTEAZĂ NUME DE UTILIZATORI, PENTRU A LE DISTRIBUI";

/*No comment provided by engineer.*/
"Send" = "Trimite";

/*No comment provided by engineer.*/
"Send Email" = "Trimite Email";

/*IMG abbrv for Image*/
"SENDING IMG" = "SE TRIMITE FOTO";

/*like URL link*/
"SENDING LINK" = "SE TRIMITE LINK";

/*No comment provided by engineer.*/
"Sent" = "Trimis";

/*No comment provided by engineer.*/
"SENT @YO!" = "TRIMIS @YO!";

/*No comment provided by engineer.*/
"SENT YO!" = "TRIMIS YO!";

/*No comment provided by engineer.*/
"SENT YOIMG!" = "TRIMIS YO-FOTO!";

/*No comment provided by engineer.*/
"SENT YOLINK!" = "TRIMIS YO-LINK!";

/*No comment provided by engineer.*/
"SENT YOYO!" = "TRIMIS YOYO!";

/*No comment provided by engineer.*/
"Session Error" = "Eroare de Sesiune";

/*No comment provided by engineer.*/
"SET A PASSCODE" = "SETEAZĂ UN COD DE ACCES";

/*No comment provided by engineer.*/
"SET A PASSCODE\n(CAN BE THE SAME AS YOU HAVE)" = "SETEAZĂ UN COD DE ACCES\n(POATE FI ACELAȘI PE CARE ÎL AI)";

/*Instructions on how to enable contacts access on iphone*/
"Settings -> Privacy -> Contacts -> Yo" = "Setări -> Confidențialitate -> Contacte -> Yo";

/*No comment provided by engineer.*/
"SHARE" = "DISTRIBUIRE";

/*No comment provided by engineer.*/
"Share" = "Distribuire";

/*No comment provided by engineer.*/
"Share on Facebook!" = "Distribuie pe Facebook!";

/*No comment provided by engineer.*/
"Share this awesome service with others! Swipe left in main screen to unsubscribe." = "Împărtășește acest uimitor serviciu cu ceilalți! Glisează la stânga pe ecranul principal pentru a te dezabona.";

/*No comment provided by engineer.*/
"SIGNUP" = "ÎNSCRIERE";

/*As in texting. may not need translating*/
"SMS" = "SMS";

/*No comment provided by engineer.*/
"Something went wrong" = "Ceva nu a mers bine.";

/*No comment provided by engineer.*/
"Subscribed!" = "Abonare finalizată!";

/*As in take picture*/
"TAKE" = "FOTOGRAFIAZĂ";

/*No comment provided by engineer.*/
"tap here to close" = "apasă aici pentru închidere";

/*No comment provided by engineer.*/
"TAP NAME TO YO" = "APASĂ NUME PENTRU YO";

/*No comment provided by engineer.*/
"Tap Name To Yo" = "Apasă Nume Pentru Yo";

/*No comment provided by engineer.*/
"Tap to add to your Yo: http://justyo.co/%@\n(if you don't have Yo app get it here %@)" = "Apasă pentru a adăuga Yo-ului tău: http://justyo.co/%@\n(dacă nu ai aplicația Yo, ia-o de aici %@)";

/*a variation on allow is permit.*/
"TAP TO ALLOW" = "APASĂ PENTRU A PERMITE";

/*No comment provided by engineer.*/
"TAP TO INVITE" = "APASĂ PENTRU A INVITA";

/*No comment provided by engineer.*/
"TAP TO LOGIN" = "APASĂ PENTRU CONECTARE";

/*Recover as in recover passcode*/
"TAP TO RECOVER" = "APASĂ PENTRU RECUPERARE";

/*No comment provided by engineer.*/
"TAP TO SET" = "APASĂ PENTRU SETARE";

/*No comment provided by engineer.*/
"TAP TO SIGNUP" = "APASĂ PENTRU ÎNSCRIERE";

/*No comment provided by engineer.*/
"Tell us how we can improve:" = "Spune-ne cum putem să ne îmbunătățim:";

/*No comment provided by engineer.*/
"TEXT SENT" = "MESAJ TRIMIS";

/*No comment provided by engineer.*/
"The profile could not be saved. Please check your network connection." = "Profilul nu a putut să fie salvat. Verifică conexiunea de internet.";

/*No comment provided by engineer.*/
"The Yo Index. Subscribe to get Yo'd by your favorite services." = "Yo Index. Abonează-te pentru a primi Yo-uri de la serviciile tale favorite.";

/*No comment provided by engineer.*/
"There is a newer version of Yo.\n%@" = "Există o versiune nouă a Yo.\n%@";

/*No comment provided by engineer.*/
"There is a newer version. Do you want to update?\n%@" = "Există o versiune nouă. Dorești actualizarea?\n%@";

/*No comment provided by engineer.*/
"There was an error:" = "S-a produs o eroare.";

/*This is how you Yo. Yo me {USERNAME}*/
"This is how you Yo. Yo me %@" = "Așa se trimit Yo-urile. Trimite-mi un Yo, %@";

/*No comment provided by engineer.*/
"This is what other users can see about you, when swiping your username to the right" = "Asta este ceea ce pot vedea alți utilizatori despre tine, când glisezi numele tău de utilizator la dreapta.";

/*No comment provided by engineer.*/
"This user already exists. Please try a different username." = "Utilizator deja existent. Te rugăm să încerci un nume de utilizator diferit.";

/*No comment provided by engineer.*/
"To block a user, swipe left on their username and tap Block." = "Pentru a bloca un utilizator, glisează la stânga pe numele său de utilizator și apasă pe Blocare.";

/*Give Yo your email Body Text. Don't change occurances of n or %@*/
"To enable password recovery:\n\n give Yo your email by tapping Send.\n\nto cancel, simply tap Cancel.\n\n\n------------------------------------------\nYour email will NOT be used for anything else other than password recovery.\n\n\n\n\n\n%@" = "Pentru a permite recuperarea parolei:\n\ntransmite emailul tău la Yo, apăsând Trimite.\n\npentru a anula, pur și simplu apasă Anulare.\n\n\n------------------------------------------------------------\nEmailul tău NU va fi folosit pentru nimic altceva în afară de recuperarea parolei.\n\n\n\n\n\n%@";

/*No comment provided by engineer.*/
"To find your friends and allow them to find you. Your contacts are not stored anywhere and will only be used to\nfind your friends." = "Pentru a-ți găsi prietenii și a le permite să te găsească. Contactele tale nu sunt stocate nicăieri și vor fi folosite doar pentru a-ți găsi prietenii.";

/*Do not translate the word Code*/
"To verify your number tap Send\n\nCode: %@\n\n\n* Carrier charges may apply" = "Pentru a-ți verifica numărul, apasă Trimite\n\nCode: %@\n\n*Pot apărea costuri din partea operatorului";

/*No comment provided by engineer.*/
"Try again later" = "Încearcă din nou";

/*No comment provided by engineer.*/
"TYPE USERNAME TO ADD" = "SCRIE NUME DE UTILIZATOR PENTRU ADĂUGARE";

/*Twitter. does not need translateing*/
"TWTR" = "TWTR";

/*No comment provided by engineer.*/
"UNBLOCK" = "DEBLOCARE";

/*No comment provided by engineer.*/
"UNBLOCKED" = "DEBLOCAT";

/*unsibscribe*/
"UNSUB" = "DEZABONARE";

/*As in software update available*/
"Update" = "Actualizare";

/*No comment provided by engineer.*/
"User Exists" = "Utilizator Existent";

/*No comment provided by engineer.*/
"USERNAME" = "NUME DE UTILIZATOR";

/*No comment provided by engineer.*/
"USERNAME TAKEN" = "NUME DE UTILIZATOR LUAT";

/*No comment provided by engineer.*/
"VERIFY PASSCODE" = "VERIFICĂ COD DE ACCES";

/*No comment provided by engineer.*/
"We couldn't find any of your friends who are on Yo. Share Yo and bring some aboard!" = "Nu am putut găsi niciun prieten de-al tău pe Yo. Distribuie Yo și adu câțiva cu tine!";

/*No comment provided by engineer.*/
"We don't have a phone number or email listed for this account. Please send us an email and we'll recover your account." = "Nu avem un număr de telefon sau un email menționat pentru acest cont. \nTe rugăm să ne trimiți un email și îți vom recupera contul.";

/*No comment provided by engineer.*/
"WELCOME" = "BINE AI VENIT";

/*No comment provided by engineer.*/
"What is Yo?" = "Ce este Yo?";

/*No comment provided by engineer.*/
"WHAT IS YO?" = "CE ESTE YO?";

/*No comment provided by engineer.*/
"When you unblock a user they will be added to your friends list but will NOT be automatically Yo'd. - Happy Yoing!" = "Când deblochezi un utilizator, acesta va fi adăugat în lista ta de prieteni, dar NU li se va trimite Yo automat. - Trimitere de Yo-uri fericită!";

/*No comment provided by engineer.*/
"Wrong code" = "Cod greșit";

/*No comment provided by engineer.*/
"Yes" = "Da";

/*Sending images title*/
"Yo & Images!" = "Yo & Fotografii!";

/*No comment provided by engineer.*/
"Yo - I got some feedback" = "Yo - am de împărtășit niște feedback";

/*No comment provided by engineer.*/
"YO ALL" = "YO LA TOȚI";

/*%@ = USERNNAME*/
"Yo all your friends to share your new username: %@" = "Trimite Yo la toți prietenii tăi, pentru a distribui noul tău nume de utilizator: %@";

/*As in resoond with a Yo*/
"Yo Back" = "Yo Răspuns";

/*Tally of total Yos the user has received/sent*/
"YO COUNT" = "STATISTICI YO";

/*Description for invite friends popup*/
"Yo is much more fun with friends!" = "Yo este mult mai distractiv cu prietenii!";

/*No comment provided by engineer.*/
"Yo Location" = "Trimite Locație cu Yo";

/*No comment provided by engineer.*/
"Yo me" = "Trimite-mi Yo";

/*No comment provided by engineer.*/
"Yo needs internet!" = "Yo are nevoie de internet!";

/*push access as is permission to send push notifications*/
"YO NEEDS PUSH ACCESS" = "YO ARE NEVOIE DE ACCES LA NOTIFICĂRILE PUSH";

/*No comment provided by engineer.*/
"Yo This" = "Yo Aceasta";

/*No comment provided by engineer.*/
"Yo! Check this out" = "Yo! Încearcă asta";

/*No comment provided by engineer.*/
"YOALL" = "TRIMITE YO LA TOȚI";

/*No comment provided by engineer.*/
"YORANDOM" = "TRIMITE ALEATORIU LA PRIETENI";

/*No comment provided by engineer.*/
"You are about to delete your phone number" = "Ești pe cale să-ți ștergi numărul de telefon";

/*alert body displayed after user blocks another user for the first time*/
"You can always unblock in the menu" = "Poți efectua întotdeauna deblocarea din meniu";

/*No comment provided by engineer.*/
"You can't send Yo's. Please contact us yo@justyo.co" = "Nu poți trimite Yo-uri. Te rugăm să ne contactezi la yo@justyo.co";

/*No comment provided by engineer.*/
"You'll be contacted shortly with instructions on changing your passcode." = "Te vom contacta în curând, cu instrucțiuni pentru schimbarea codului tău de acces.";

/*No comment provided by engineer.*/
"You'll receive a link to change your passcode shortly." = "În curând, vei primi un link pentru schimbarea codului tău de acces.";

/*Sending images body*/
"You're about to Yo your first image! Anyone with the link will be able to view it." = "Ești pe cale să trimiți prima ta fotografie prin Yo! Oricine are linkul, va fi capabil să o vizualizeze.";

/*No comment provided by engineer.*/
"Your current session is no longer valid. Please log in again." = "Sesiunea ta curentă nu mai este validă. Te rugăm să te conectezi din nou.";